fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = КонецДня(Дата);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
